<?php
/**
 * FunAdmin
 * ============================================================================
 * 版权所有 2017-2028 FunAdmin，并保留所有权利。
 * 网站地址: http://www.FunAdmin.com
 * ----------------------------------------------------------------------------
 * 采用最新Thinkphp6实现
 * ============================================================================
 * Author: yuege
 * Date: 2021/10/11
 * Time: 19:17
 */


return [
    'title' => 'apiDoc',                   # 文档title
    'version' => '2.0',                               # 文档版本
    'copyright' => 'Powered By FunAdmin',          # 版权信息
    'password' => '123456',                              # 访问密码，为空不需要密码
    'qq' => '994927909',                        # 咨询QQ
    'document' => [//这里是一些全局的解析文档
        "explain" => [
            'name' => '说明',
            'list' => [
                '登录态' => ['200'],
                'formId收集' => ['测试', '测试2'],
            ]
        ],
        "code" => [
            'name' => '返回码',
            'list' => [
                '200' => '请求成功',
                '404' => '页面未找到',
                '401' => '未授权',
                '500' => '服务器错误',
            ]
        ]
    ],
    // 全局请求header,一般存放token之类的
    'header' => [

    ],
    // 全局请求参数
    'params' => [
        '__uid' => 2
    ],
    'controller' => [
        [
            'name'=>'v1版本',
            'list'=>[
                'apidoc\controller\v1\ApiTest', //支持两层控制器URL自动生成
            ]
        ],
        [
            'name'=>'v3版本',
            'list'=>[
                'api\controller\v1\Member', //控制器的命名空间+控制器名称(不需要加\\app)
            ]
        ]
    ],
    // 过滤、不解析的方法名称
    'filter_method' => [
        '_empty'
    ]
];